CRUD-general-purpose/ranking_batch-0_apache-cassandra-400-vanilla-os-medium-medium-ionoscloud-2022_0_lBGFnnaF/0_load.txt
/usr/java/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/cassandra-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/lib/HdrHistogram-2.1.4.jar:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/core-0.17.0.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/cassandra-binding/lib/netty-handler-4.0.33.Final.jar:/binary/ycsb/cassandra-binding/lib/guava-16.0.1.jar:/binary/ycsb/cassandra-binding/lib/cassandra-driver-core-3.0.0.jar:/binary/ycsb/cassandra-binding/lib/slf4j-api-1.7.25.jar:/binary/ycsb/cassandra-binding/lib/metrics-core-3.1.2.jar:/binary/ycsb/cassandra-binding/lib/netty-common-4.0.33.Final.jar:/binary/ycsb/cassandra-binding/lib/netty-buffer-4.0.33.Final.jar:/binary/ycsb/cassandra-binding/lib/netty-transport-4.0.33.Final.jar:/binary/ycsb/cassandra-binding/lib/cassandra-binding-0.17.0.jar:/binary/ycsb/cassandra-binding/lib/netty-codec-4.0.33.Final.jar site.ycsb.Client -db site.ycsb.db.CassandraCQLClient -s -p hosts=85.215.206.25,85.215.242.207,85.215.202.39 -p cassandra.keyspace=ycsb -target 25000 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
Command line: -db site.ycsb.db.CassandraCQLClient -s -p hosts=85.215.206.25,85.215.242.207,85.215.202.39 -p cassandra.keyspace=ycsb -target 25000 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
2022-04-27 15:55:03:888 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2022-04-27 15:55:13:849 10 sec: 233108 operations; 23310.8 current ops/sec; est completion in 3 minutes [INSERT: Count=233127, Max=225279, Min=216, Avg=1996.09, 90=3955, 99=18399, 99.9=146303, 99.99=168319] 
2022-04-27 15:55:23:849 20 sec: 483108 operations; 25000 current ops/sec; est completion in 3 minutes [INSERT: Count=249993, Max=431103, Min=234, Avg=1087.24, 90=963, 99=3517, 99.9=278527, 99.99=425983] 
2022-04-27 15:55:33:849 30 sec: 733106 operations; 24999.8 current ops/sec; est completion in 2 minutes [INSERT: Count=249999, Max=516607, Min=223, Avg=1122.09, 90=957, 99=3215, 99.9=386303, 99.99=512767] 
2022-04-27 15:55:43:849 40 sec: 973999 operations; 24089.3 current ops/sec; est completion in 2 minutes [INSERT: Count=240880, Max=518143, Min=230, Avg=903.73, 90=675, 99=2801, 99.9=13551, 99.99=512767] 
2022-04-27 15:55:53:849 50 sec: 1233108 operations; 25910.9 current ops/sec; est completion in 2 minutes [INSERT: Count=259122, Max=415743, Min=233, Avg=705.96, 90=682, 99=2817, 99.9=10447, 99.99=412927] 
2022-04-27 15:56:03:849 60 sec: 1483107 operations; 24999.9 current ops/sec; est completion in 2 minutes [INSERT: Count=249998, Max=565247, Min=236, Avg=1150.59, 90=967, 99=3673, 99.9=363263, 99.99=565247] 
2022-04-27 15:56:13:850 70 sec: 1729070 operations; 24596.3 current ops/sec; est completion in 2 minutes [INSERT: Count=245951, Max=522239, Min=220, Avg=1187.07, 90=993, 99=4943, 99.9=364543, 99.99=518911] 
2022-04-27 15:56:23:849 80 sec: 1983105 operations; 25403.5 current ops/sec; est completion in 2 minutes [INSERT: Count=254049, Max=331007, Min=226, Avg=1354.6, 90=1270, 99=5283, 99.9=260351, 99.99=328191] 
2022-04-27 15:56:33:849 90 sec: 2233105 operations; 25000 current ops/sec; est completion in 1 minute [INSERT: Count=250001, Max=414975, Min=211, Avg=1454.11, 90=1309, 99=6423, 99.9=301567, 99.99=411647] 
2022-04-27 15:56:43:850 100 sec: 2474475 operations; 24137 current ops/sec; est completion in 1 minute [INSERT: Count=241355, Max=444159, Min=213, Avg=721.95, 90=672, 99=3041, 99.9=12015, 99.99=378879] 
2022-04-27 15:56:53:849 110 sec: 2733108 operations; 25863.3 current ops/sec; est completion in 1 minute [INSERT: Count=258645, Max=542719, Min=217, Avg=1092.7, 90=906, 99=3355, 99.9=367615, 99.99=535039] 
2022-04-27 15:57:03:849 120 sec: 2983106 operations; 24999.8 current ops/sec; est completion in 1 minute [INSERT: Count=250000, Max=542719, Min=225, Avg=978.61, 90=876, 99=3721, 99.9=21183, 99.99=537087] 
2022-04-27 15:57:13:850 130 sec: 3233116 operations; 25001 current ops/sec; est completion in 1 minute [INSERT: Count=250009, Max=503295, Min=215, Avg=1312.86, 90=1212, 99=5327, 99.9=333823, 99.99=498175] 
2022-04-27 15:57:23:849 140 sec: 3483107 operations; 24999.1 current ops/sec; est completion in 1 minute [INSERT: Count=250006, Max=330495, Min=224, Avg=1371.36, 90=1286, 99=6467, 99.9=267775, 99.99=326655] 
2022-04-27 15:57:33:849 150 sec: 3733107 operations; 25000 current ops/sec; est completion in 51 seconds [INSERT: Count=249985, Max=651775, Min=221, Avg=1214.91, 90=1084, 99=4983, 99.9=315135, 99.99=433919] 
2022-04-27 15:57:43:849 160 sec: 3983106 operations; 24999.9 current ops/sec; est completion in 41 seconds [INSERT: Count=250021, Max=392191, Min=221, Avg=873.53, 90=737, 99=4079, 99.9=12015, 99.99=389631] 
2022-04-27 15:57:53:850 170 sec: 4233110 operations; 25000.4 current ops/sec; est completion in 31 seconds [INSERT: Count=249996, Max=564223, Min=222, Avg=1185.27, 90=1022, 99=3829, 99.9=368383, 99.99=558591] 
2022-04-27 15:58:03:850 180 sec: 4483113 operations; 25000.3 current ops/sec; est completion in 21 seconds [INSERT: Count=249997, Max=514303, Min=226, Avg=958.56, 90=846, 99=3327, 99.9=12599, 99.99=511743] 
2022-04-27 15:58:13:849 190 sec: 4733107 operations; 24999.4 current ops/sec; est completion in 11 seconds [INSERT: Count=249995, Max=401663, Min=237, Avg=1162.21, 90=1040, 99=3965, 99.9=282623, 99.99=396031] 
2022-04-27 15:58:23:850 200 sec: 4983113 operations; 25000.6 current ops/sec; est completion in 1 second [INSERT: Count=250012, Max=319743, Min=210, Avg=1380.52, 90=1387, 99=6311, 99.9=300031, 99.99=317695] 
2022-04-27 15:58:26:864 203 sec: 5000000 operations; 5602.85 current ops/sec; [CLEANUP: Count=100, Max=2252799, Min=0, Avg=22520.85, 90=4, 99=22, 99.9=2252799, 99.99=2252799] [INSERT: Count=16859, Max=234111, Min=247, Avg=2151.35, 90=1521, 99=10271, 99.9=231935, 99.99=233983] 
[OVERALL], RunTime(ms), 203014
[OVERALL], Throughput(ops/sec), 24628.843331001804
[TOTAL_GCS_PS_Scavenge], Count, 175
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1156
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.5694188578127617
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 175
[TOTAL_GC_TIME], Time(ms), 1156
[TOTAL_GC_TIME_%], Time(%), 0.5694188578127617
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 22520.85
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 2252799
[CLEANUP], 95thPercentileLatency(us), 12
[CLEANUP], 99thPercentileLatency(us), 22
[INSERT], Operations, 5000000
[INSERT], AverageLatency(us), 1161.6352786
[INSERT], MinLatency(us), 210
[INSERT], MaxLatency(us), 651775
[INSERT], 95thPercentileLatency(us), 1794
[INSERT], 99thPercentileLatency(us), 5367
[INSERT], Return=OK, 5000000